In [186]:
import pandas as pd
import numpy as np

In [187]:
data = [[1, 100],[2,100],[3,50]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [188]:
employee

   id  salary
0   1     100
1   2     100
2   3      50

In [194]:
df = employee['salary'].drop_duplicates().nlargest(2)

In [195]:
df

0    100
2     50
Name: salary, dtype: int64

In [196]:
df = pd.DataFrame(df)

In [197]:
df

   salary
0     100
2      50

In [198]:
df = df[df['salary'] < df['salary'].max()]
if df['salary'].empty == True:
    df = pd.DataFrame({'salary' : [None]})

In [199]:
df.rename(columns={'salary' : 'SecondHighestSalary'})

   SecondHighestSalary
2                   50